<center><img src="https://i2.wp.com/hackwagon.com/wp-content/uploads/2017/02/Logo-Web-Export.png?ssl=1" width=200/></center>
<h1> Hackwagon Academy DS102 Lesson 2A </h1>
<h2> Introduction to Pandas Part 2</h2> 
<h3> Lesson Outline </h3>

- 1. [Recap](#1)
    - 1.1 [Series](#1.1)
    - 1.2 [DataFrame](#1.2)
    - 1.3 [Filtering](#1.3)
    - 1.4 [Simple Aggregation](#1.4)
    - [Practice I](#P1)
- 2. [Data Preprocessing & Cleaning](#2)
    - 2.1 [Functions Recap](#2.1)
    - 2.2 [.apply()](#2.2)
    - 2.3 [.replace()](#2.3)
    - 2.4 [Pokemon Dataset](#2.4)
    - [Practice II](#P2)
- 3. [Pivot Tables](#3)
    - 3.1 [Visualized](#3.1)
    - 3.2 [Accessing](#3.2)

<div class="alert alert-block alert-info">
<b>Datasets:</b>

1. hackwagon-102pandassandbox.csv

2. wines-3k.csv

3. pokemon.csv
</div>

### Import Libraries

In [29]:
import pandas as pd
import numpy as np

<hr/>

<a id='1'><h2><img src="https://images.vexels.com/media/users/3/153978/isolated/preview/483ef8b10a46e28d02293a31570c8c56-warning-sign-colored-stroke-icon-by-vexels.png" width=23 align="left"><font color="salmon">&nbsp;1.</font><font color="salmon"> Recap </font> </h2></a>

<a id='1.1'><h3>1.1 DataFrame</h3></a>

A two-dimensional, tabular data structure with labeled axes (rows and columns), and is the **primary** pandas data structure. You can think of a `DataFrame` as a spreadsheet in Python.
A `DataFrame` is made up of multiple `Series` objects stuck together vertically and horizontally. <br>

In [30]:
feedback_df = pd.read_csv('hackwagon-102pandassandbox.csv')
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students
0,1,DS101,False,Dick,Jon,Nil,40
1,2,DS101,True,Vera,Andre,7,43
2,3,DS102,False,Vera,Jon,9,41
3,4,DS102,True,Dick,Andre,Nope,44
4,5,DS101,True,Dick,Andre,10,45

<a id='1.1'><h3>1.2 Series</h3></a>

A `Series` == Row / Column of a `Dataframe`

- Extracting a column from a `Dataframe` is very similar to accessing data in a `dictionary`.

In [5]:
feedback_df['Instructor']

0      Jon
1    Andre
2      Jon
3    Andre
4    Andre
Name: Instructor, dtype: object

### Create New Column with Series 

We can create new columns to add to a DataFrame.

```python
    df['new_col_name'] = Series
```

In [31]:
feedback_df['StudentsSquared'] = feedback_df['Students'] ** 2

feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students,StudentsSquared
0,1,DS101,False,Dick,Jon,Nil,40,1600
1,2,DS101,True,Vera,Andre,7,43,1849
2,3,DS102,False,Vera,Jon,9,41,1681
3,4,DS102,True,Dick,Andre,Nope,44,1936
4,5,DS101,True,Dick,Andre,10,45,2025

<a id='1.3'><h3>1.3 Filtering</h3></a>

We can filter for results within a `DataFrame` to get the data we want. 

We specify the column we want to isolate in the DataFrame, then specify the boolean condition we are looking for. For example, we want to find the `Females` in the `Sex` column. 

```python
df['sex'] == 'Females'

# or for multiple conditions, we link them by & (and) or | (or) symbols
# where each condition is surrounded by a ()

(df['sex'] == 'Females') & (df['type_of_course'] == 'Medicine')

```

This gives us a Boolean Series of multiple `True` and `False` values.

In [37]:
ds101_only = feedback_df['ClassType'] == 'DS101'
andre_only = feedback_df['Instructor'] == 'Andre'

ds101_andre = feedback_df[ds101_only & andre_only]
ds101_andre

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students,StudentsSquared,IncreasedStudents
1,2,DS101,True,Vera,Andre,7,43,1849,44
4,5,DS101,True,Dick,Andre,10,45,2025,46

<a id='1.4'><h3>1.4 Simple Aggregation</h3></a>

`Dataframes` and `Series` objects have many useful methods to help you compute statistics.

<table>
  <tr>
    <th>Statistical measure</th>
    <th>Dataframe method</th>
    <th>Series method</th>
    <th>Description</th>
  </tr>
  <tr>
    <td>Mean</td>
    <td>df.mean()</td>
    <td>df['column_name'].mean()</td>
    <td>Returns the mean of all columns / the selected column</td>
  </tr>
  <tr>
    <td>Median</td>
    <td>df.median()</td>
    <td>df['column_name'].median()</td>
    <td>Returns the median of all columns / the selected column</td>
  </tr>
  <tr>
    <td>Standard Deviation</td>
    <td>df.std()</td>
    <td>df['column_name'].std()</td>
    <td>Returns the standard deviation of all columns / the selected column</td>
  </tr>
  <tr>
    <td>Sum</td>
    <td>df.sum()</td>
    <td>df['column_name'].std()</td>
    <td>Returns the sum of all columns / the selected column</td>
  </tr>
  <tr>
    <td>...</td>
    <td>...</td>
    <td>...</td>
    <td>...</td>
  </tr>
</table>

In [ ]:
feedback_df['Students'].mean()

<a id='P1'><h2> <img src="https://cdn.shopify.com/s/files/1/1200/7374/products/book_aec28e76-52ec-44ab-bc01-41df1279c89f_550x825.png?v=1473897430" width=25 align="left"> <font color="darkorange"> &nbsp; Practice I </font><font color="skyblue"> * </font></h2></a>

### Read Dataset

Read the `wines-3k.csv` dataset as `wines_df` (don't forget the `sep='|'` parameter) and preview the dataset with `.head()`.

In [16]:
wines_df = pd.read_csv('wines-3k.csv', sep = '|')

### Filter for `Australia` wines and get their average `price`

**Expected Output:**
    
    33.80232558139535

In [38]:
country_filt = wines_df['country'] == 'Australia'

wines_df_filt = wines_df[country_filt]

wines_df_filt['price'].mean()

33.80232558139535

<a id='1'><h2><img src="https://images.vexels.com/media/users/3/153978/isolated/preview/483ef8b10a46e28d02293a31570c8c56-warning-sign-colored-stroke-icon-by-vexels.png" width=23 align="left"><font color="salmon">&nbsp;2.</font><font color="salmon"> Data Preprocessing & Cleaning </font> </h2></a>

Pandas allow for quick data preprocessing and cleaning with useful methods such as:

1. .apply()
2. .replace()
3. Pivot Table

<a id='2.1'><h3>2.1 Functions Recap</h3></a>

<img src='https://i.imgur.com/jhpovl8.png' width="350">

In [21]:
def give_first_item(a_list):
    return a_list[0]

In [22]:
print(give_first_item([10,20,30,40]))
print(give_first_item([100,200,300]))

10
100

### The Lambda 

The `lambda` reserved keyword is a short form way of making a function.

<img src="https://i.imgur.com/dVP1PBy.png" width='200'>

In [64]:
lambda_give_first = lambda x : x[0]

print(lambda_give_first([10,20,30,40]))

10

### Hackwagon Pandas Sandbox 

Open the pandas sandbox dataset

In [65]:
feedback_df = pd.read_csv('hackwagon-102pandassandbox.csv')
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students
0,1,DS101,False,Dick,Jon,Nil,40
1,2,DS101,True,Vera,Andre,7,43
2,3,DS102,False,Vera,Jon,9,41
3,4,DS102,True,Dick,Andre,Nope,44
4,5,DS101,True,Dick,Andre,10,45

<a id='2.2'><h3>2.2   .apply()</h3></a>

The `.apply()` function is very useful for data cleaning a variable in a dataset. 

<img src="https://i.imgur.com/99M6Vl7.png" width="400">
<img src="https://i.imgur.com/wRKXB85.png" width="500">

Even after applying the method, <b>it does not change the column of df permanently.</b> The method returns a new Series object, where you can store it as another variable.

In [32]:
increased_students = feedback_df['Students'].apply(lambda x: x+1)
feedback_df['IncreasedStudents'] = increased_students
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students,StudentsSquared,IncreasedStudents
0,1,DS101,False,Dick,Jon,Nil,40,1600,41
1,2,DS101,True,Vera,Andre,7,43,1849,44
2,3,DS102,False,Vera,Jon,9,41,1681,42
3,4,DS102,True,Dick,Andre,Nope,44,1936,45
4,5,DS101,True,Dick,Andre,10,45,2025,46

<a id='2.3'><h3>2.3  .replace()</h3></a>

The `.replace()` method works similarly to `.apply()` but just that its parameter takes in a <b>single value or a list</b> and it requires a second argument, a value to be replaced with.

### Investigate Unique

To effectively use replace properly, we need to first investigate if the number of unique values within a variable. We can do that by using `.unique()`.

In [46]:
feedback_df['Rating'].unique()

array([ 0,  7,  9, 10], dtype=int64)

### Use `.replace()`
<img src="https://i.imgur.com/lW14HGv.png" width="400">
<img src="https://i.imgur.com/u1deMLN.png" width="500">

Similar to the `.apply()` method, even after applying the method, <b>it does not change the column of df permanently.</b> The method returns a new Series object. Therefore it needs to be stored back to the same column or a new column in the DataFrame.

In [45]:
replaced = feedback_df['Rating'].replace(['Nil','Nope'],0)
feedback_df['Rating'] = replaced.apply(np.int) # To make sure row is numeric
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students,StudentsSquared,IncreasedStudents
0,1,DS101,False,Dick,Jon,0,40,1600,41
1,2,DS101,True,Vera,Andre,7,43,1849,44
2,3,DS102,False,Vera,Jon,9,41,1681,42
3,4,DS102,True,Dick,Andre,0,44,1936,45
4,5,DS101,True,Dick,Andre,10,45,2025,46

<a id='2.4'><h3>2.4  Pokemon Dataset</h3></a>

Read the `pokemon.csv` as a DataFrame called `pokemon_df`.

In [50]:
pokemon_df = pd.read_csv('pokemon.csv')

pokemon_df.head()

,Pokemon_ID,Name,Type,HP,Attack,Defense,Speed,Legendary
0,1,Bulbasaur,Grass,45,49,49,45,False
1,2,Ivysaur,Grass,60,62,63,60,False
2,3,Venusaur,Grass,80,82,83,80,False
3,3,VenusaurMega Venusaur,Grass,80,100,123,80,False
4,4,Charmander,Fire,39,52,43,65,False

<a id='P1'><h2> <img src="https://cdn.shopify.com/s/files/1/1200/7374/products/book_aec28e76-52ec-44ab-bc01-41df1279c89f_550x825.png?v=1473897430" width=25 align="left"> <font color="darkorange"> &nbsp; Practice II </font><font color="skyblue"> * </font></h2></a>

### Calculate Min Max

Create 2 variables that has the maxmimum and minimum value of the `Speed` column, naming them `max_speed` and `min_speed`.

**Expected Output:**
``` python   
    180 # max speed
    5 # min speed
```

In [55]:
maxspeed = pokemon_df['Speed'].max()
minspeed = pokemon_df['Speed'].min()

### Create Normalise Function

Using the two variables created above, prepare a function called `calculate_normalised_speed()` that has a parameter `speed`. Inside the function, it should return the result of the following formula:

$$
\text{Normalised Speed}_x = \frac{Speed_x - Speed_{min}}{Speed_{max} - Speed_{min}}
$$

_You can use `lambda` or `def`_

In [79]:
calculate_normalised_speed = lambda x : (x-minspeed)/(maxspeed-minspeed)

### Using `.apply()`, Create New Column

Using the `.apply()` method on the `Speed` column, create a new column called `Normalised_Speed` to the `df`. <b>Make sure you store it back to the `pokemon_df`</b>

In [80]:
normalized_speed = pokemon_df['Speed'].apply(calculate_normalised_speed)

pokemon_df['Normalised_Speed'] = normalized_speed

,Pokemon_ID,Name,Type,HP,Attack,Defense,Speed,Legendary,Normalised_Speed
0,1,Bulbasaur,Grass,45,49,49,45,False,0.228571
1,2,Ivysaur,Grass,60,62,63,60,False,0.314286
2,3,Venusaur,Grass,80,82,83,80,False,0.428571
3,3,VenusaurMega Venusaur,Grass,80,100,123,80,False,0.428571
4,4,Charmander,Fire,39,52,43,65,False,0.342857

### Use `.head()` to preview newly altered df

In [82]:
pokemon_df.head()

,Pokemon_ID,Name,Type,HP,Attack,Defense,Speed,Legendary,Normalised_Speed
0,1,Bulbasaur,Grass,45,49,49,45,False,0.228571
1,2,Ivysaur,Grass,60,62,63,60,False,0.314286
2,3,Venusaur,Grass,80,82,83,80,False,0.428571
3,3,VenusaurMega Venusaur,Grass,80,100,123,80,False,0.428571
4,4,Charmander,Fire,39,52,43,65,False,0.342857

### Use `.to_csv()` to save your preprocessed data

Save the new df as a new csv file with the `.to_csv()` with `normalised_pokemon.csv` as the name in the ().

In [84]:
pokemon_df.to_csv('normalised_pokemon.csv')

<a id='3'><h2><img src="https://images.vexels.com/media/users/3/153978/isolated/preview/483ef8b10a46e28d02293a31570c8c56-warning-sign-colored-stroke-icon-by-vexels.png" width=23 align="left"><font color="salmon">&nbsp;3.</font><font color="salmon"> Pivot Tables </font> </h2></a>

Pivot Table is one of the most useful and powerful features in pandas but understanding them can be quite challenging. We shall keep our example simple for now, so that it is easy to understand by using our `hackwagon-102sandbox.csv`.

In [89]:
feedback_df = pd.read_csv('hackwagon-102pandassandbox.csv')
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students
0,1,DS101,False,Dick,Jon,Nil,40
1,2,DS101,True,Vera,Andre,7,43
2,3,DS102,False,Vera,Jon,9,41
3,4,DS102,True,Dick,Andre,Nope,44
4,5,DS101,True,Dick,Andre,10,45

#### Clean the `Rating` Column by `.replace()`

Remove all the `Nil` or `Nope` by using the `.replace()` method and place them as 0

In [104]:
replaced = feedback_df['Rating'].replace(['Nil','Nope'], 0)
feedback_df['Rating'] = replaced.apply(np.int) # To make column numeric
feedback_df.head()

,ClassID,ClassType,Co-Instructor,Coordinating_TA,Instructor,Rating,Students
0,1,DS101,False,Dick,Jon,0,40
1,2,DS101,True,Vera,Andre,7,43
2,3,DS102,False,Vera,Jon,9,41
3,4,DS102,True,Dick,Andre,0,44
4,5,DS101,True,Dick,Andre,10,45

<a id='3.1'><h3>3.1 Visualized</h3></a>

<img src="https://pbpython.com/images/pivot-table-datasheet.png">

In [105]:
pivoted = pd.pivot_table(feedback_df,
                        index=["Instructor"], 
                        columns=["ClassType"], # 
                        values=["Rating"], # 
                        aggfunc=[np.sum], # 
                        margins=True,
                        fill_value = 0)


pivoted

              sum
           Rating
ClassType   DS101 DS102 All
Instructor
Andre          17     0  17
Jon             0     9   9
All            17     9  26

**Credits**
- [Wine Reviews, Kaggle](https://www.kaggle.com/zynicide/wine-reviews) for the dataset
- [Pokemon with stats, Kaggle](https://www.kaggle.com/abcsds/pokemon) for the dataset